app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "star", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "saishu"], ["description", ""], ["picture", "img-message-02.jpg"], ["star", 0], ["created_at", "2015-07-25 07:14:48.164345"], ["updated_at", "2015-07-25 07:14:48.164345"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "1589863.png"], ["updated_at", "2015-07-25 07:14:16.086695"], ["id", 3]]

    def set_idea
      @idea = Idea.find(params[:id])
      @comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 2]]